app/controllers/bills_controller.rb

INSERT INTO "bills" ("id", "bill_id", "title", "primary_sponsor_id", "created_at", "updated_at", "supporter_count", "opposer_count", "primary_sponsor_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def import
    file = params[:file]
    return redirect_to bills_path, notice: "Please upload only CSV" unless file.content_type == "text/csv"

    file = File.open(file)
    csv = CSV.parse(file, headers: true, col_sep: ";")
    csv.each do |row|
      bill = row["id,title,sponsor_id"].split(',')
      p bill

      bill_hash = {}
      bill_hash[:id] = bill[0].to_i
      bill_hash[:title] = bill[1]
      bill_hash[:primary_sponsor_id] = bill[2].to_i
      bill_hash[:primary_sponsor_name] = ''
      bill_hash[:supporter_count] = 0
      bill_hash[:opposer_count] = 0

      Bill.create(bill_hash)

SELECT "bills".* FROM "bills"
SELECT "legislators".* FROM "legislators" WHERE (id == 2900994) ORDER BY "legislators"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE (bill_id == 2900994) ORDER BY "votes"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "vote_results" WHERE (vote_id == 3314452 AND vote_type == 1)
SELECT COUNT(*) FROM "vote_results" WHERE (vote_id == 3314452 AND vote_type == 2)
INSERT INTO "bills" ("id", "title", "primary_sponsor_id", "created_at", "updated_at", "supporter_count", "opposer_count", "primary_sponsor_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "bills" SET "updated_at" = ?, "primary_sponsor_name" = ? WHERE "bills"."id" = ?  [["updated_at", "2023-03-09 19:04:49.444485"], ["primary_sponsor_name", "Name not found"], ["id", 2900994]]
SELECT "legislators".* FROM "legislators" WHERE (id == 2900994) ORDER BY "legislators"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @bills = Bill.all

    respond_to do |format|
      @bills.each do |bill|

        @sponsor = Legislator.where("id == ?", bill[:primary_sponsor_id]).first
        @votes = Vote.where("bill_id == ?", bill[:id]).first
        @supporter_results = VoteResult.where("vote_id == ? AND vote_type == ?", @votes[:id].to_i, 1).count
        @opposer_results = VoteResult.where("vote_id == ? AND vote_type == ?", @votes[:id].to_i, 2).count

        if !bill[:supporter_count] || (@supporter_results != 0)
          bill[:supporter_count] = @supporter_results
          bill.save
        end

        if !bill[:opposer_count] || (@opposer_results != 0)
          bill[:opposer_count] = @opposer_results
          bill.save
        end

        if bill[:primary_sponsor_name].empty? || ( @sponsor == nil)
          bill[:primary_sponsor_name] = "Name not found"
          bill.save
        else
          bill[:primary_sponsor_name] = @sponsor.name
          bill.save

INSERT INTO "bills" ("id", "bill_id", "title", "primary_sponsor_id", "created_at", "updated_at", "supporter_count", "opposer_count", "primary_sponsor_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bill = Bill.new(bill_params)

    respond_to do |format|
      if @bill.save

DELETE FROM "bills" WHERE "bills"."id" = ?  [["id", 0]]
---
  def destroy
    @bill.destroy

SELECT "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_bill
      @bill = Bill.find(params[:id])