app/controllers/legislators_controller.rb

  def import
    file = params[:file]
    return redirect_to legislators_path, notice: "Please upload only CSV" unless file.content_type == "text/csv"

    file = File.open(file)
    csv = CSV.parse(file, headers: true, col_sep: ";")
    csv.each do |row|
      legislator = row["id,name"].split(",", 2)

      legislator_hash = {}
      legislator_hash[:id] = legislator[0].to_i
      legislator_hash[:name] = legislator[1]
      legislator_hash[:num_supported_bills] = 0
      legislator_hash[:num_opposed_bills] = 0

      Legislator.create(legislator_hash)
---
INSERT INTO "legislators" ("id", "legislator_id", "name", "created_at", "updated_at", "num_supported_bills", "num_opposed_bills") VALUES (?, ?, ?, ?, ?, ?, ?)

  def index
    @legislators = Legislator.all

    respond_to do |format|
      @legislators.each do |legislator|
        @supported_count = VoteResult.where("legislator_id == ? AND vote_type == ?", legislator[:id], 1).count
        @opposed_count = VoteResult.where("legislator_id == ? AND vote_type == ?", legislator[:id], 2).count

        legislator[:num_supported_bills] = @supported_count
        legislator[:num_opposed_bills] = @opposed_count
        legislator.save
---
SELECT "legislators".* FROM "legislators"
SELECT COUNT(*) FROM "vote_results" WHERE (legislator_id == 15318 AND vote_type == 1)
UPDATE "legislators" SET "updated_at" = ?, "num_supported_bills" = ?, "num_opposed_bills" = ? WHERE "legislators"."id" = ?  [["updated_at", "2023-03-09 20:22:48.700475"], ["num_supported_bills", 1], ["num_opposed_bills", 1], ["id", 15318]]

  def create
    @legislator = Legislator.new(legislator_params)

    respond_to do |format|
      if @legislator.save
---
INSERT INTO "legislators" ("id", "legislator_id", "name", "created_at", "updated_at", "num_supported_bills", "num_opposed_bills") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @legislator.destroy
---
DELETE FROM "legislators" WHERE "legislators"."id" = ?  [["id", 10051993]]

    def set_legislator
      @legislator = Legislator.find(params[:id])
---
SELECT "legislators".* FROM "legislators" WHERE "legislators"."id" = ? LIMIT ?  [["id", 10051993], ["LIMIT", 1]]