app/controllers/votes_controller.rb

  def import
    file = params[:file]
    return redirect_to votes_path, notice: "Please upload only CSV" unless file.content_type == "text/csv"

    file = File.open(file)
    csv = CSV.parse(file, headers: true, col_sep: ";")
    csv.each do |row|
      vote = row["id,bill_id"].split(",", 2)

      vote_hash = {}
      vote_hash[:id] = vote[0].to_i
      vote_hash[:bill_id] = vote[1].to_i

      Vote.create(vote_hash)
---
INSERT INTO "votes" ("id", "vote_id", "bill_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", 3314452], ["vote_id", nil], ["bill_id", 2900994], ["created_at", "2023-03-09 14:57:03.940946"], ["updated_at", "2023-03-09 14:57:03.940946"]]

  def index
    @votes = Vote.all
---
SELECT "votes".* FROM "votes"

    def set_vote
      @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]