app/controllers/vote_results_controller.rb

INSERT INTO "vote_results" ("id", "legislator_id", "vote_id", "vote_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 92516784], ["legislator_id", 400440], ["vote_id", 3321166], ["vote_type", 2], ["created_at", "2023-03-09 19:18:52.221563"], ["updated_at", "2023-03-09 19:18:52.221563"]]
---
  def import
    file = params[:file]
    return redirect_to bills_path, notice: "Please upload only CSV" unless file.content_type == "text/csv"

    file = File.open(file)
    csv = CSV.parse(file, headers: true, col_sep: ";")
    csv.each do |row|
      p row
      vote_result = row["id,legislator_id,vote_id,vote_type"].split(',')
      p vote_result

      vote_result_hash = {}
      vote_result_hash[:id] = vote_result[0].to_i
      vote_result_hash[:legislator_id] = vote_result[1].to_i
      vote_result_hash[:vote_id] = vote_result[2].to_i
      vote_result_hash[:vote_type] = vote_result[3].to_i

      VoteResult.create(vote_result_hash)

SELECT "vote_results".* FROM "vote_results"
---
  def index
    @vote_results = VoteResult.all