app/models/bill.rb

SELECT "bills".* FROM "bills"
---
  def self.to_csv
    attributes = %w{id title primary_sponsor_name supporter_count opposer_count}
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.each do |bill|