app/models/legislator.rb

SELECT "legislators".* FROM "legislators"
---
  def self.to_csv
    attributes = %w{id name num_supported_bills num_opposed_bills}
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.each do |legislator|